RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/utilities/shell/fsl_shell.c
#if 0
#define SHELL_STRUCT_OFFSET(type, field) ((size_t) & (((type *)0)->field))
#define SHEEL_COMMAND_POINTER(node) \
    ((shell_command_t *)(((uint32_t)(node)) - SHELL_STRUCT_OFFSET(shell_command_t, link)))
#else
#define SHEEL_COMMAND_POINTER(node) \
    ((shell_command_t *)(((uint32_t)(node)) - (sizeof(shell_command_t) - sizeof(list_element_t))))
#endif
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
static shell_status_t SHELL_HelpCommand(shell_handle_t shellHandle, int32_t argc, char **argv); /*!< help command */

static shell_status_t SHELL_ExitCommand(shell_handle_t shellHandle, int32_t argc, char **argv); /*!< exit command */

static int32_t SHELL_ParseLine(const char *cmd, uint32_t len, char *argv[]); /*!< parse line command */

static int32_t SHELL_StringCompare(const char *str1, const char *str2, int32_t count); /*!< compare string command */

static void SHELL_ProcessCommand(shell_context_handle_t *shellContextHandle, const char *cmd); /*!< process a command */

static void SHELL_GetHistoryCommand(shell_context_handle_t *shellContextHandle,
                                    uint8_t hist_pos); /*!< get commands history */

static void SHELL_AutoComplete(shell_context_handle_t *shellContextHandle); /*!< auto complete command */

static shell_status_t SHELL_GetChar(shell_context_handle_t *shellContextHandle,
                                    uint8_t *ch); /*!< get a char from communication interface */

#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
SHELL_STATIC void SHELL_Task(void *param); /*!<  Shell task*/
#endif

/*******************************************************************************
 * Variables
 ******************************************************************************/

static SHELL_COMMAND_DEFINE(help, "\r\n\"help\": List all the registered commands\r\n", SHELL_HelpCommand, 0);
static SHELL_COMMAND_DEFINE(exit, "\r\n\"exit\": Exit program\r\n", SHELL_ExitCommand, 0);

static char s_paramBuffer[SHELL_BUFFER_SIZE];

#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
#if defined(OSA_USED)
#if (defined(SHELL_USE_COMMON_TASK) && (SHELL_USE_COMMON_TASK > 0U))
#else
/*
 * \brief Defines the serial manager task's stack
 */
static OSA_TASK_DEFINE(SHELL_Task, SHELL_TASK_PRIORITY, 1, SHELL_TASK_STACK_SIZE, false);
#endif
#endif /* OSA_USED */
#endif /* SHELL_NON_BLOCKING_MODE */
/*******************************************************************************
 * Code
 ******************************************************************************/

#if (defined(SHELL_NON_BLOCKING_MODE) && (SHELL_NON_BLOCKING_MODE > 0U))
SHELL_STATIC void SHELL_SerialManagerRxCallback(void *callbackParam,
                                                serial_manager_callback_message_t *message,
                                                serial_manager_status_t status)
{
    shell_context_handle_t *shellHandle;

    assert(callbackParam);
    assert(message);

    shellHandle = (shell_context_handle_t *)callbackParam;

    if (0U == shellHandle->notificationPost)
    {
        shellHandle->notificationPost = 1U;
#if defined(OSA_USED)

#if (defined(SHELL_USE_COMMON_TASK) && (SHELL_USE_COMMON_TASK > 0U))
        shellHandle->commontaskMsg.callback      = SHELL_Task;
        shellHandle->commontaskMsg.callbackParam = shellHandle;
        (void)COMMON_TASK_post_message(&shellHandle->commontaskMsg);
#else
        (void)OSA_EventSet((osa_event_handle_t)shellHandle->event, SHELL_EVENT_DATA_ARRIVED);
#endif

#else
        SHELL_Task(shellHandle);
#endif
    }
}
#endif

static void SHELL_WriteBuffer(char *buffer, int32_t *indicator, char val, int len)
{
    shell_context_handle_t *shellContextHandle;
    int i              = 0;
    shellContextHandle = (shell_context_handle_t *)(void *)buffer;

    for (i = 0; i < len; i++)
    {
        if ((*indicator + 1) >= (int32_t)SHELL_SPRINTF_BUFFER_SIZE)
        {
#if (!defined(SDK_DEBUGCONSOLE_UART) && (defined(SDK_DEBUGCONSOLE) && (SDK_DEBUGCONSOLE != 1)))
            if (NULL == shellContextHandle->serialHandle)
            {
                for (uint32_t index = 0; index < ((uint32_t)*indicator); index++)
                {
                    (void)putchar(shellContextHandle->printBuffer[index]);
                }
            }
            else
#endif
            {
                (void)SerialManager_WriteBlocking(shellContextHandle->serialWriteHandle,
                                                  (uint8_t *)shellContextHandle->printBuffer, (uint32_t)*indicator);
            }

            shellContextHandle->printLength += (uint32_t)*indicator;
            *indicator = 0;
        }

        shellContextHandle->printBuffer[*indicator] = val;
        (*indicator)++;
    }
}

static int SHELL_Sprintf(void *buffer, const char *formatString, va_list ap)
{
    shell_context_handle_t *shellContextHandle;
    uint32_t length;
    shellContextHandle = (shell_context_handle_t *)buffer;

    length = (uint32_t)StrFormatPrintf(formatString, ap, (char *)buffer, SHELL_WriteBuffer);
    shellContextHandle->printLength += length;
    return (int32_t)length;
}

static void SHELL_hisOperation(uint8_t ch, shell_context_handle_t *shellContextHandle)
{
    switch ((char)ch)
    {
        /* History operation here */
        case 'A': /* Up key */
            SHELL_GetHistoryCommand(shellContextHandle, (uint8_t)shellContextHandle->hist_current);
            if (shellContextHandle->hist_current < (shellContextHandle->hist_count - 1U))
            {
                shellContextHandle->hist_current++;
            }
            break;
        case 'B': /* Down key */
            SHELL_GetHistoryCommand(shellContextHandle, (uint8_t)shellContextHandle->hist_current);
            if (shellContextHandle->hist_current > 0U)
            {
                shellContextHandle->hist_current--;
            }
            break;
        case 'D': /* Left key */
            if ((bool)shellContextHandle->c_pos)
            {
                (void)SHELL_WRITEX(shellContextHandle, "\b", 1);
                shellContextHandle->c_pos--;
            }
            break;
        case 'C': /* Right key */
            if (shellContextHandle->c_pos < shellContextHandle->l_pos)
            {
                (void)SHELL_WRITEX(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos], 1);
                shellContextHandle->c_pos++;
            }
            break;
        default:
            /* MISRA C-2012 Rule 16.4 */
            break;
    }
}

static void SHELL_SerialManagerHandle(shell_context_handle_t *shellContextHandle)
{
    if (shellContextHandle->serialReadHandle != NULL)
    {
        (void)SerialManager_CloseReadHandle(shellContextHandle->serialReadHandle);
        shellContextHandle->serialReadHandle = NULL;
    }
    if (shellContextHandle->serialWriteHandle != NULL)
    {
        (void)SerialManager_CloseWriteHandle(shellContextHandle->serialWriteHandle);
        shellContextHandle->serialWriteHandle = NULL;
    }
}

#if SHELL_AUTO_COMPLETE
/* Move the cursor to the beginning of line */
static void SHELL_MoveCursorToBeginningLine(shell_context_handle_t *shellContextHandle)
{
    uint32_t i;
    for (i = 0; i < (uint32_t)shellContextHandle->c_pos; i++)
    {
        (void)SHELL_WRITEX(shellContextHandle, "\b", 1);
    }
    /* Do auto complete */
    SHELL_AutoComplete(shellContextHandle);
    /* Move position to end */
    shellContextHandle->l_pos = (uint8_t)strlen(shellContextHandle->line);
    shellContextHandle->c_pos = shellContextHandle->l_pos;
}
#endif

/* There must be at last one char */
static void SHELL_HandleBackspaceKey(shell_context_handle_t *shellContextHandle)
{
    shellContextHandle->l_pos--;
    shellContextHandle->c_pos--;

    if (shellContextHandle->l_pos > shellContextHandle->c_pos)
    {
        (void)memmove(&shellContextHandle->line[shellContextHandle->c_pos],
                      &shellContextHandle->line[shellContextHandle->c_pos + 1U],
                      (uint32_t)shellContextHandle->l_pos - (uint32_t)shellContextHandle->c_pos);
        shellContextHandle->line[shellContextHandle->l_pos] = '\0';
        (void)SHELL_WRITEX(shellContextHandle, "\b", 1);
        (void)SHELL_WRITEX(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                           strlen(&shellContextHandle->line[shellContextHandle->c_pos]));
        (void)SHELL_WRITEX(shellContextHandle, "  \b", 3);

        /* Reset position */
        uint32_t i;
        for (i = (uint32_t)shellContextHandle->c_pos; i <= (uint32_t)shellContextHandle->l_pos; i++)
        {
            (void)SHELL_WRITEX(shellContextHandle, "\b", 1);
        }
    }
    else /* Normal backspace operation */
    {
        (void)SHELL_WRITEX(shellContextHandle, "\b \b", 3);
        shellContextHandle->line[shellContextHandle->l_pos] = '\0';
    }
}
/* Normal character */
static void SHELL_HandleNormalChar(shell_context_handle_t *shellContextHandle, uint8_t ch)
{
    if (shellContextHandle->c_pos < shellContextHandle->l_pos)
    {
        uint32_t i;
        (void)memmove(&shellContextHandle->line[shellContextHandle->c_pos + 1U],
                      &shellContextHandle->line[shellContextHandle->c_pos],
                      (uint32_t)shellContextHandle->l_pos - (uint32_t)shellContextHandle->c_pos);
        shellContextHandle->line[shellContextHandle->c_pos] = (char)ch;
        (void)SHELL_WRITEX(shellContextHandle, &shellContextHandle->line[shellContextHandle->c_pos],
                           strlen(&shellContextHandle->line[shellContextHandle->c_pos]));

        for (i = (uint32_t)shellContextHandle->c_pos; i < (uint32_t)shellContextHandle->l_pos; i++)
        {
            (void)SHELL_WRITEX(shellContextHandle, "\b", 1);
        }
    }
    else
    {
        shellContextHandle->line[shellContextHandle->l_pos] = (char)ch;
        (void)SHELL_WRITEX(shellContextHandle, &shellContextHandle->line[shellContextHandle->l_pos], 1);
    }
}

